# Pivot and Pivot table

In [1]:
import pandas as pd
df=pd.read_csv('D:/Data/weather_cities.csv')
df

           Day     City  Temprature  Windspeed  Event
0   04/04/2023  karachi          32          6   rain
1   05/04/2023  karachi          35          5   snow
2   06/04/2023  karachi          47          6  sunny
3   07/04/2023  karachi          43          7  sunny
4   08/04/2023  larkana          25          8  sunny
5   09/04/2023  larkana          33          6   snow
6   10/04/2023  larkana          36          8   snow
7   11/04/2023  larkana          38          6   snow
8   12/04/2023   sukkur          56          7   rain
9   13/04/2023   sukkur          46          6   rain
10  14/04/2023   sukkur          15          9   rain
11  15/04/2023   sukkur          13          8   snow

# Pivot help to reshape the dataframe

In [3]:
df.pivot(index="Day",columns="City")

           Temprature                Windspeed                  Event          \
City          karachi larkana sukkur   karachi larkana sukkur karachi larkana
Day
04/04/2023       32.0     NaN    NaN       6.0     NaN    NaN    rain     NaN
05/04/2023       35.0     NaN    NaN       5.0     NaN    NaN    snow     NaN
06/04/2023       47.0     NaN    NaN       6.0     NaN    NaN   sunny     NaN
07/04/2023       43.0     NaN    NaN       7.0     NaN    NaN   sunny     NaN
08/04/2023        NaN    25.0    NaN       NaN     8.0    NaN     NaN   sunny
09/04/2023        NaN    33.0    NaN       NaN     6.0    NaN     NaN    snow
10/04/2023        NaN    36.0    NaN       NaN     8.0    NaN     NaN    snow
11/04/2023        NaN    38.0    NaN       NaN     6.0    NaN     NaN    snow
12/04/2023        NaN     NaN   56.0       NaN     NaN    7.0     NaN     NaN
13/04/2023        NaN     NaN   46.0       NaN     NaN    6.0     NaN     NaN
14/04/2023        NaN     NaN   15.0       NaN     NaN    9.0     NaN     NaN
15/04/2023        NaN     NaN   13.0       NaN     NaN    8.0     NaN     NaN


City       sukkur
Day
04/04/2023    NaN
05/04/2023    NaN
06/04/2023    NaN
07/04/2023    NaN
08/04/2023    NaN
09/04/2023    NaN
10/04/2023    NaN
11/04/2023    NaN
12/04/2023   rain
13/04/2023   rain
14/04/2023   rain
15/04/2023   snow

# Pivot table is used to summarize and aggregate data inside dataframe

In [4]:
df.pivot_table(index="City",columns="Day",aggfunc="mean") #sum,count,diff,mean

        Temprature                                                         \
Day     04/04/2023 05/04/2023 06/04/2023 07/04/2023 08/04/2023 09/04/2023
City
karachi       32.0       35.0       47.0       43.0        NaN        NaN
larkana        NaN        NaN        NaN        NaN       25.0       33.0
sukkur         NaN        NaN        NaN        NaN        NaN        NaN

                                                     ...  Windspeed  \
Day     10/04/2023 11/04/2023 12/04/2023 13/04/2023  ... 06/04/2023
City                                                 ...
karachi        NaN        NaN        NaN        NaN  ...        6.0
larkana       36.0       38.0        NaN        NaN  ...        NaN
sukkur         NaN        NaN       56.0       46.0  ...        NaN

                                                                           \
Day     07/04/2023 08/04/2023 09/04/2023 10/04/2023 11/04/2023 12/04/2023
City
karachi        7.0        NaN        NaN        NaN        NaN        NaN
larkana        NaN        8.0        6.0        8.0        6.0        NaN
sukkur         NaN        NaN        NaN        NaN        NaN        7.0


Day     13/04/2023 14/04/2023 15/04/2023
City
karachi        NaN        NaN        NaN
larkana        NaN        NaN        NaN
sukkur         6.0        9.0        8.0

[3 rows x 24 columns]

In [5]:
df.pivot_table(index="City",columns="Day",margins=True)

        Temprature                                                         \
Day     04/04/2023 05/04/2023 06/04/2023 07/04/2023 08/04/2023 09/04/2023
City
karachi       32.0       35.0       47.0       43.0        NaN        NaN
larkana        NaN        NaN        NaN        NaN       25.0       33.0
sukkur         NaN        NaN        NaN        NaN        NaN        NaN
All           32.0       35.0       47.0       43.0       25.0       33.0

                                                     ...  Windspeed  \
Day     10/04/2023 11/04/2023 12/04/2023 13/04/2023  ... 07/04/2023
City                                                 ...
karachi        NaN        NaN        NaN        NaN  ...        7.0
larkana       36.0       38.0        NaN        NaN  ...        NaN
sukkur         NaN        NaN       56.0       46.0  ...        NaN
All           36.0       38.0       56.0       46.0  ...        7.0

                                                                           \
Day     08/04/2023 09/04/2023 10/04/2023 11/04/2023 12/04/2023 13/04/2023
City
karachi        NaN        NaN        NaN        NaN        NaN        NaN
larkana        8.0        6.0        8.0        6.0        NaN        NaN
sukkur         NaN        NaN        NaN        NaN        7.0        6.0
All            8.0        6.0        8.0        6.0        7.0        6.0


Day     14/04/2023 15/04/2023       All
City
karachi        NaN        NaN  6.000000
larkana        NaN        NaN  7.000000
sukkur         9.0        8.0  7.500000
All            9.0        8.0  6.833333

[4 rows x 26 columns]

In [6]:
df

           Day     City  Temprature  Windspeed  Event
0   04/04/2023  karachi          32          6   rain
1   05/04/2023  karachi          35          5   snow
2   06/04/2023  karachi          47          6  sunny
3   07/04/2023  karachi          43          7  sunny
4   08/04/2023  larkana          25          8  sunny
5   09/04/2023  larkana          33          6   snow
6   10/04/2023  larkana          36          8   snow
7   11/04/2023  larkana          38          6   snow
8   12/04/2023   sukkur          56          7   rain
9   13/04/2023   sukkur          46          6   rain
10  14/04/2023   sukkur          15          9   rain
11  15/04/2023   sukkur          13          8   snow

# Change date to dateformate

In [15]:
df['Day']=pd.to_datetime(df['Day'])
df

          Day     City  Temprature  Windspeed  Event
0  2023-04-04  karachi          32          6   rain
1  2023-05-04  karachi          35          5   snow
2  2023-06-04  karachi          47          6  sunny
3  2023-07-04  karachi          43          7  sunny
4  2023-08-04  larkana          25          8  sunny
5  2023-09-04  larkana          33          6   snow
6  2023-10-04  larkana          36          8   snow
7  2023-11-04  larkana          38          6   snow
8  2023-12-04   sukkur          56          7   rain
9  2023-04-13   sukkur          46          6   rain
10 2023-04-14   sukkur          15          9   rain
11 2023-04-15   sukkur          13          8   snow

# Now apply grouper function

In [16]:
df.pivot_table(index=pd.Grouper(freq='M',key='Day'),columns='City')

           Temprature                    Windspeed
City          karachi larkana     sukkur   karachi larkana    sukkur
Day
2023-04-30       32.0     NaN  24.666667       6.0     NaN  7.666667
2023-05-31       35.0     NaN        NaN       5.0     NaN       NaN
2023-06-30       47.0     NaN        NaN       6.0     NaN       NaN
2023-07-31       43.0     NaN        NaN       7.0     NaN       NaN
2023-08-31        NaN    25.0        NaN       NaN     8.0       NaN
2023-09-30        NaN    33.0        NaN       NaN     6.0       NaN
2023-10-31        NaN    36.0        NaN       NaN     8.0       NaN
2023-11-30        NaN    38.0        NaN       NaN     6.0       NaN
2023-12-31        NaN     NaN  56.000000       NaN     NaN  7.000000

# Reshap dataframe using melt and melt to use transform or reshap data

In [17]:
df

          Day     City  Temprature  Windspeed  Event
0  2023-04-04  karachi          32          6   rain
1  2023-05-04  karachi          35          5   snow
2  2023-06-04  karachi          47          6  sunny
3  2023-07-04  karachi          43          7  sunny
4  2023-08-04  larkana          25          8  sunny
5  2023-09-04  larkana          33          6   snow
6  2023-10-04  larkana          36          8   snow
7  2023-11-04  larkana          38          6   snow
8  2023-12-04   sukkur          56          7   rain
9  2023-04-13   sukkur          46          6   rain
10 2023-04-14   sukkur          15          9   rain
11 2023-04-15   sukkur          13          8   snow

In [30]:
df1=pd.melt(df,id_vars=['Day']),#var_name="City",value_name="temprature")
df1

(          Day    variable    value
 0  2023-04-04        City  karachi
 1  2023-05-04        City  karachi
 2  2023-06-04        City  karachi
 3  2023-07-04        City  karachi
 4  2023-08-04        City  larkana
 5  2023-09-04        City  larkana
 6  2023-10-04        City  larkana
 7  2023-11-04        City  larkana
 8  2023-12-04        City   sukkur
 9  2023-04-13        City   sukkur
 10 2023-04-14        City   sukkur
 11 2023-04-15        City   sukkur
 12 2023-04-04  Temprature       32
 13 2023-05-04  Temprature       35
 14 2023-06-04  Temprature       47
 15 2023-07-04  Temprature       43
 16 2023-08-04  Temprature       25
 17 2023-09-04  Temprature       33
 18 2023-10-04  Temprature       36
 19 2023-11-04  Temprature       38
 20 2023-12-04  Temprature       56
 21 2023-04-13  Temprature       46
 22 2023-04-14  Temprature       15
 23 2023-04-15  Temprature       13
 24 2023-04-04   Windspeed        6
 25 2023-05-04   Windspeed        5
 26 2023-06-04   Windspeed        6
 27 2023-07-04   Windspeed        7
 28 2023-08-04   Windspeed        8
 29 2023-09-04   Windspeed        6
 30 2023-10-04   Windspeed        8
 31 2023-11-04   Windspeed        6
 32 2023-12-04   Windspeed        7
 33 2023-04-13   Windspeed        6
 34 2023-04-14   Windspeed        9
 35 2023-04-15   Windspeed        8
 36 2023-04-04       Event     rain
 37 2023-05-04       Event     snow
 38 2023-06-04       Event    sunny
 39 2023-07-04       Event    sunny
 40 2023-08-04       Event    sunny
 41 2023-09-04       Event     snow
 42 2023-10-04       Event     snow
 43 2023-11-04       Event     snow
 44 2023-12-04       Event     rain
 45 2023-04-13       Event     rain
 46 2023-04-14       Event     rain
 47 2023-04-15       Event     snow,)

# In this dataframe taking  any variable apply following command

In [26]:
df1[df1["variable"]=='City']

          Day variable    value
0  2023-04-04     City  karachi
1  2023-05-04     City  karachi
2  2023-06-04     City  karachi
3  2023-07-04     City  karachi
4  2023-08-04     City  larkana
5  2023-09-04     City  larkana
6  2023-10-04     City  larkana
7  2023-11-04     City  larkana
8  2023-12-04     City   sukkur
9  2023-04-13     City   sukkur
10 2023-04-14     City   sukkur
11 2023-04-15     City   sukkur

In [27]:
df1[df1["variable"]=="Temprature"]

          Day    variable value
12 2023-04-04  Temprature    32
13 2023-05-04  Temprature    35
14 2023-06-04  Temprature    47
15 2023-07-04  Temprature    43
16 2023-08-04  Temprature    25
17 2023-09-04  Temprature    33
18 2023-10-04  Temprature    36
19 2023-11-04  Temprature    38
20 2023-12-04  Temprature    56
21 2023-04-13  Temprature    46
22 2023-04-14  Temprature    15
23 2023-04-15  Temprature    13

In [28]:
df1[df1["variable"]=="Event"]

          Day variable  value
36 2023-04-04    Event   rain
37 2023-05-04    Event   snow
38 2023-06-04    Event  sunny
39 2023-07-04    Event  sunny
40 2023-08-04    Event  sunny
41 2023-09-04    Event   snow
42 2023-10-04    Event   snow
43 2023-11-04    Event   snow
44 2023-12-04    Event   rain
45 2023-04-13    Event   rain
46 2023-04-14    Event   rain
47 2023-04-15    Event   snow

# Stocks and unstocks

In [40]:
df2=pd.read_csv('D:/Data/stocks.csv',header=[0,1])
df2

,Unnamed: 0_level_0,Price,Unnamed: 2_level_0,Unnamed: 3_level_0,Unnamed: 4_level_0,Price to earning ration P/E,Unnamed: 6_level_0
,compny,Facebook,Unnamed: 2_level_1,Google,MicroSoft,FacebookGoogle,Microsoft
0,06/04/2023,155,NaN,987,66,37.000,30.0
1,07/04/2023,234,NaN,867,69,34.700,31.9
2,08/04/2023,23,NaN,998,63,34.222,32.0
3,09/04/2023,156,NaN,954,65,33.400,33.9
4,10/04/2023,145,NaN,932,75,35.900,32.5

In [42]:
df2.stack(level=0)

                               Facebook  FacebookGoogle  Google  MicroSoft  \
0 Price                           155.0             NaN     NaN        NaN
  Price to earning ration P/E       NaN          37.000     NaN        NaN
  Unnamed: 0_level_0                NaN             NaN     NaN        NaN
  Unnamed: 3_level_0                NaN             NaN   987.0        NaN
  Unnamed: 4_level_0                NaN             NaN     NaN       66.0
  Unnamed: 6_level_0                NaN             NaN     NaN        NaN
1 Price                           234.0             NaN     NaN        NaN
  Price to earning ration P/E       NaN          34.700     NaN        NaN
  Unnamed: 0_level_0                NaN             NaN     NaN        NaN
  Unnamed: 3_level_0                NaN             NaN   867.0        NaN
  Unnamed: 4_level_0                NaN             NaN     NaN       69.0
  Unnamed: 6_level_0                NaN             NaN     NaN        NaN
2 Price                            23.0             NaN     NaN        NaN
  Price to earning ration P/E       NaN          34.222     NaN        NaN
  Unnamed: 0_level_0                NaN             NaN     NaN        NaN
  Unnamed: 3_level_0                NaN             NaN   998.0        NaN
  Unnamed: 4_level_0                NaN             NaN     NaN       63.0
  Unnamed: 6_level_0                NaN             NaN     NaN        NaN
3 Price                           156.0             NaN     NaN        NaN
  Price to earning ration P/E       NaN          33.400     NaN        NaN
  Unnamed: 0_level_0                NaN             NaN     NaN        NaN
  Unnamed: 3_level_0                NaN             NaN   954.0        NaN
  Unnamed: 4_level_0                NaN             NaN     NaN       65.0
  Unnamed: 6_level_0                NaN             NaN     NaN        NaN
4 Price                           145.0             NaN     NaN        NaN
  Price to earning ration P/E       NaN          35.900     NaN        NaN
  Unnamed: 0_level_0                NaN             NaN     NaN        NaN
  Unnamed: 3_level_0                NaN             NaN   932.0        NaN
  Unnamed: 4_level_0                NaN             NaN     NaN       75.0
  Unnamed: 6_level_0                NaN             NaN     NaN        NaN

                               Microsoft  Unnamed: 2_level_1      compny
0 Price                              NaN                 NaN         NaN
  Price to earning ration P/E        NaN                 NaN         NaN
  Unnamed: 0_level_0                 NaN                 NaN  06/04/2023
  Unnamed: 3_level_0                 NaN                 NaN         NaN
  Unnamed: 4_level_0                 NaN                 NaN         NaN
  Unnamed: 6_level_0                30.0                 NaN         NaN
1 Price                              NaN                 NaN         NaN
  Price to earning ration P/E        NaN                 NaN         NaN
  Unnamed: 0_level_0                 NaN                 NaN  07/04/2023
  Unnamed: 3_level_0                 NaN                 NaN         NaN
  Unnamed: 4_level_0                 NaN                 NaN         NaN
  Unnamed: 6_level_0                31.9                 NaN         NaN
2 Price                              NaN                 NaN         NaN
  Price to earning ration P/E        NaN                 NaN         NaN
  Unnamed: 0_level_0                 NaN                 NaN  08/04/2023
  Unnamed: 3_level_0                 NaN                 NaN         NaN
  Unnamed: 4_level_0                 NaN                 NaN         NaN
  Unnamed: 6_level_0                32.0                 NaN         NaN
3 Price                              NaN                 NaN         NaN
  Price to earning ration P/E        NaN                 NaN         NaN
  Unnamed: 0_level_0                 NaN                 NaN  09/04/2023
  Unnamed: 3_level_0                 NaN                 NaN         NaN
  Unnamed: 4_level_0                 NaN                 NaN         NaN
  Unnamed: 6_level_0                33.9                 NaN         NaN
4 Price                              NaN                 NaN         NaN
  Price to earning ration P/E        NaN                 NaN         NaN
  Unnamed: 0_level_0                 NaN                 NaN  10/04/2023
  Unnamed: 3_level_0                 NaN                 NaN         NaN
  Unnamed: 4_level_0                 NaN                 NaN         NaN
  Unnamed: 6_level_0                32.5                 NaN         NaN

In [47]:

stack=df2.stack()
stack.unstack()

     Price                                                   \
  Facebook FacebookGoogle Google MicroSoft Microsoft compny
0    155.0            NaN    NaN       NaN       NaN    NaN
1    234.0            NaN    NaN       NaN       NaN    NaN
2     23.0            NaN    NaN       NaN       NaN    NaN
3    156.0            NaN    NaN       NaN       NaN    NaN
4    145.0            NaN    NaN       NaN       NaN    NaN

  Price to earning ration P/E                                  ...  \
                     Facebook FacebookGoogle Google MicroSoft  ...
0                         NaN         37.000    NaN       NaN  ...
1                         NaN         34.700    NaN       NaN  ...
2                         NaN         34.222    NaN       NaN  ...
3                         NaN         33.400    NaN       NaN  ...
4                         NaN         35.900    NaN       NaN  ...

  Unnamed: 4_level_0                            Unnamed: 6_level_0  \
              Google MicroSoft Microsoft compny           Facebook
0                NaN      66.0       NaN    NaN                NaN
1                NaN      69.0       NaN    NaN                NaN
2                NaN      63.0       NaN    NaN                NaN
3                NaN      65.0       NaN    NaN                NaN
4                NaN      75.0       NaN    NaN                NaN


  FacebookGoogle Google MicroSoft Microsoft compny
0            NaN    NaN       NaN      30.0    NaN
1            NaN    NaN       NaN      31.9    NaN
2            NaN    NaN       NaN      32.0    NaN
3            NaN    NaN       NaN      33.9    NaN
4            NaN    NaN       NaN      32.5    NaN

[5 rows x 42 columns]

In [48]:
df2

,Unnamed: 0_level_0,Price,Unnamed: 2_level_0,Unnamed: 3_level_0,Unnamed: 4_level_0,Price to earning ration P/E,Unnamed: 6_level_0
,compny,Facebook,Unnamed: 2_level_1,Google,MicroSoft,FacebookGoogle,Microsoft
0,06/04/2023,155,NaN,987,66,37.000,30.0
1,07/04/2023,234,NaN,867,69,34.700,31.9
2,08/04/2023,23,NaN,998,63,34.222,32.0
3,09/04/2023,156,NaN,954,65,33.400,33.9
4,10/04/2023,145,NaN,932,75,35.900,32.5

In [2]:
import pandas as pd

# Crosstab method

In [4]:
df=pd.read_csv('D:/Data/survey.csv')
df

     Name  Nationality     Sex  Age Handness
0    Sajan   pakistani    male   22    right
1   Jeewan      indian    male   21    right
2   mufeed   pakistani    male   22    right
3   sameer      indian    male   21     left
4  farhan1          us    male   20     left
5   ayesha      indian  female   21    right
6   zaryab   pakistani    male   22    right
7     aqsa          us  female   21     left
8    yasir          us    male   22    right
9   maryam          us  female   22     left

In [5]:
pd.crosstab(df.Nationality,df.Handness)

Handness     left  right
Nationality
indian          1      2
pakistani       0      3
us              3      1

In [6]:
pd.crosstab(df.Sex,df.Handness)

Handness  left  right
Sex
female       2      1
male         2      5

# Print total

In [7]:
pd.crosstab(df.Sex,df.Handness,margins=True)

Handness  left  right  All
Sex
female       2      1    3
male         2      5    7
All          4      6   10

In [9]:
pd.crosstab(df.Sex,df.Handness)

Handness  left  right
Sex
female       2      1
male         2      5

In [10]:
pd.crosstab(df.Sex,df.Handness,normalize="index")

Handness      left     right
Sex
female    0.666667  0.333333
male      0.285714  0.714286